Model: "model_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_75 (Batc multiple                  240       
_________________________________________________________________
stgcn_33 (STGCN)             multiple                  38208     
_________________________________________________________________
stgcn_34 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_35 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_36 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_37 (STGCN)             multiple                  182400    
_________________________________________________________________
stgcn_38 (STGCN)             multiple                  198144    
_________________________________________________________________
stgcn_39 (STGCN)             multiple                  198144    
_________________________________________________________________
stgcn_40 (STGCN)             multiple                  725248    
_________________________________________________________________
stgcn_41 (STGCN)             multiple                  789504    
_________________________________________________________________
stgcn_42 (STGCN)             multiple                  789504    
_________________________________________________________________
global_average_pooling2d_6 ( multiple                  0         
_________________________________________________________________
conv2d_97 (Conv2D)           multiple                  15420     
=================================================================
Total params: 3,087,772
Trainable params: 0
Non-trainable params: 3,087,772
_________________________________________________________________
