Model: "model_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_69 (Batc multiple                  240       
_________________________________________________________________
stgcn_30 (STGCN)             multiple                  38208     
_________________________________________________________________
stgcn_31 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_32 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_33 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_34 (STGCN)             multiple                  182400    
_________________________________________________________________
stgcn_35 (STGCN)             multiple                  198144    
_________________________________________________________________
stgcn_36 (STGCN)             multiple                  198144    
_________________________________________________________________
stgcn_37 (STGCN)             multiple                  725248    
_________________________________________________________________
stgcn_38 (STGCN)             multiple                  789504    
_________________________________________________________________
stgcn_39 (STGCN)             multiple                  789504    
_________________________________________________________________
global_average_pooling2d_3 ( multiple                  0         
_________________________________________________________________
conv2d_91 (Conv2D)           multiple                  11308     
=================================================================
Total params: 3,083,660
Trainable params: 0
Non-trainable params: 3,083,660
_________________________________________________________________
