Model: "model2_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_12 (Dense)             multiple                  50372     
_________________________________________________________________
dense_13 (Dense)             multiple                  25216     
_________________________________________________________________
dense_14 (Dense)             multiple                  645       
=================================================================
Total params: 76,233
Trainable params: 76,233
Non-trainable params: 0
_________________________________________________________________
