Model: "model_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_92 (Batc multiple                  240       
_________________________________________________________________
stgcn_40 (STGCN)             multiple                  38208     
_________________________________________________________________
stgcn_41 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_42 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_43 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_44 (STGCN)             multiple                  182400    
_________________________________________________________________
stgcn_45 (STGCN)             multiple                  198144    
_________________________________________________________________
stgcn_46 (STGCN)             multiple                  198144    
_________________________________________________________________
stgcn_47 (STGCN)             multiple                  725248    
_________________________________________________________________
stgcn_48 (STGCN)             multiple                  789504    
_________________________________________________________________
stgcn_49 (STGCN)             multiple                  789504    
_________________________________________________________________
global_average_pooling2d_4 ( multiple                  0         
_________________________________________________________________
conv2d_114 (Conv2D)          multiple                  30840     
=================================================================
Total params: 3,103,192
Trainable params: 0
Non-trainable params: 3,103,192
_________________________________________________________________
