Model: "model2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                multiple                  50372     
_________________________________________________________________
dense_1 (Dense)              multiple                  25216     
_________________________________________________________________
dense_2 (Dense)              multiple                  1290      
=================================================================
Total params: 76,878
Trainable params: 76,878
Non-trainable params: 0
_________________________________________________________________
