Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_23 (Batc multiple                  240       
_________________________________________________________________
stgcn_10 (STGCN)             multiple                  38208     
_________________________________________________________________
stgcn_11 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_12 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_13 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_14 (STGCN)             multiple                  182400    
_________________________________________________________________
stgcn_15 (STGCN)             multiple                  198144    
_________________________________________________________________
stgcn_16 (STGCN)             multiple                  198144    
_________________________________________________________________
stgcn_17 (STGCN)             multiple                  725248    
_________________________________________________________________
stgcn_18 (STGCN)             multiple                  789504    
_________________________________________________________________
stgcn_19 (STGCN)             multiple                  789504    
_________________________________________________________________
global_average_pooling2d_1 ( multiple                  0         
_________________________________________________________________
conv2d_45 (Conv2D)           multiple                  30840     
=================================================================
Total params: 3,103,192
Trainable params: 788,480
Non-trainable params: 2,314,712
_________________________________________________________________
