Model: "model2_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_3 (Dense)              multiple                  50372     
_________________________________________________________________
dense_4 (Dense)              multiple                  25216     
_________________________________________________________________
dense_5 (Dense)              multiple                  645       
=================================================================
Total params: 76,233
Trainable params: 76,233
Non-trainable params: 0
_________________________________________________________________
