Model: "model_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_100 (Bat multiple                  240       
_________________________________________________________________
stgcn_44 (STGCN)             multiple                  38208     
_________________________________________________________________
stgcn_45 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_46 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_47 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_48 (STGCN)             multiple                  182400    
_________________________________________________________________
stgcn_49 (STGCN)             multiple                  198144    
_________________________________________________________________
stgcn_50 (STGCN)             multiple                  198144    
_________________________________________________________________
stgcn_51 (STGCN)             multiple                  725248    
_________________________________________________________________
stgcn_52 (STGCN)             multiple                  789504    
_________________________________________________________________
stgcn_53 (STGCN)             multiple                  789504    
_________________________________________________________________
global_average_pooling2d_8 ( multiple                  0         
_________________________________________________________________
conv2d_122 (Conv2D)          multiple                  11308     
=================================================================
Total params: 3,083,660
Trainable params: 0
Non-trainable params: 3,083,660
_________________________________________________________________
