Model: "model2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                multiple                  50372     
_________________________________________________________________
dense_1 (Dense)              multiple                  25216     
_________________________________________________________________
dense_2 (Dense)              multiple                  1935      
=================================================================
Total params: 77,523
Trainable params: 77,523
Non-trainable params: 0
_________________________________________________________________
