Model: "model2_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_9 (Dense)              multiple                  50372     
_________________________________________________________________
dense_10 (Dense)             multiple                  25216     
_________________________________________________________________
dense_11 (Dense)             multiple                  645       
=================================================================
Total params: 76,233
Trainable params: 76,233
Non-trainable params: 0
_________________________________________________________________
