Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_46 (Batc multiple                  240       
_________________________________________________________________
stgcn_20 (STGCN)             multiple                  38208     
_________________________________________________________________
stgcn_21 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_22 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_23 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_24 (STGCN)             multiple                  182400    
_________________________________________________________________
stgcn_25 (STGCN)             multiple                  198144    
_________________________________________________________________
stgcn_26 (STGCN)             multiple                  198144    
_________________________________________________________________
stgcn_27 (STGCN)             multiple                  725248    
_________________________________________________________________
stgcn_28 (STGCN)             multiple                  789504    
_________________________________________________________________
stgcn_29 (STGCN)             multiple                  789504    
_________________________________________________________________
global_average_pooling2d_2 ( multiple                  0         
_________________________________________________________________
conv2d_68 (Conv2D)           multiple                  11308     
=================================================================
Total params: 3,083,660
Trainable params: 788,480
Non-trainable params: 2,295,180
_________________________________________________________________
