Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization (BatchNo multiple                  240       
_________________________________________________________________
stgcn (STGCN)                multiple                  38208     
_________________________________________________________________
stgcn_1 (STGCN)              multiple                  49920     
_________________________________________________________________
stgcn_2 (STGCN)              multiple                  49920     
_________________________________________________________________
stgcn_3 (STGCN)              multiple                  49920     
_________________________________________________________________
stgcn_4 (STGCN)              multiple                  182400    
_________________________________________________________________
stgcn_5 (STGCN)              multiple                  198144    
_________________________________________________________________
stgcn_6 (STGCN)              multiple                  198144    
_________________________________________________________________
stgcn_7 (STGCN)              multiple                  725248    
_________________________________________________________________
stgcn_8 (STGCN)              multiple                  789504    
_________________________________________________________________
stgcn_9 (STGCN)              multiple                  789504    
_________________________________________________________________
global_average_pooling2d (Gl multiple                  0         
_________________________________________________________________
conv2d_22 (Conv2D)           multiple                  11308     
=================================================================
Total params: 3,083,660
Trainable params: 788,480
Non-trainable params: 2,295,180
_________________________________________________________________
