Model: "model2_single_layer_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_4 (Dense)              multiple                  2570      
=================================================================
Total params: 2,570
Trainable params: 2,570
Non-trainable params: 0
_________________________________________________________________
