Model: "model_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_115 (Bat multiple                  240       
_________________________________________________________________
stgcn_50 (STGCN)             multiple                  38208     
_________________________________________________________________
stgcn_51 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_52 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_53 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_54 (STGCN)             multiple                  182400    
_________________________________________________________________
stgcn_55 (STGCN)             multiple                  198144    
_________________________________________________________________
stgcn_56 (STGCN)             multiple                  198144    
_________________________________________________________________
stgcn_57 (STGCN)             multiple                  725248    
_________________________________________________________________
stgcn_58 (STGCN)             multiple                  789504    
_________________________________________________________________
stgcn_59 (STGCN)             multiple                  789504    
_________________________________________________________________
global_average_pooling2d_5 ( multiple                  0         
_________________________________________________________________
conv2d_137 (Conv2D)          multiple                  15420     
=================================================================
Total params: 3,087,772
Trainable params: 0
Non-trainable params: 3,087,772
_________________________________________________________________
