Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_50 (Batc multiple                  240       
_________________________________________________________________
stgcn_22 (STGCN)             multiple                  38208     
_________________________________________________________________
stgcn_23 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_24 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_25 (STGCN)             multiple                  49920     
_________________________________________________________________
stgcn_26 (STGCN)             multiple                  182400    
_________________________________________________________________
stgcn_27 (STGCN)             multiple                  198144    
_________________________________________________________________
stgcn_28 (STGCN)             multiple                  198144    
_________________________________________________________________
stgcn_29 (STGCN)             multiple                  725248    
_________________________________________________________________
stgcn_30 (STGCN)             multiple                  789504    
_________________________________________________________________
stgcn_31 (STGCN)             multiple                  789504    
_________________________________________________________________
global_average_pooling2d_4 ( multiple                  0         
_________________________________________________________________
conv2d_72 (Conv2D)           multiple                  11308     
=================================================================
Total params: 3,083,660
Trainable params: 0
Non-trainable params: 3,083,660
_________________________________________________________________
