Model: "model2_single_layer"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                multiple                  3855      
=================================================================
Total params: 3,855
Trainable params: 3,855
Non-trainable params: 0
_________________________________________________________________
