Model: "model2_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_6 (Dense)              multiple                  50372     
_________________________________________________________________
dense_7 (Dense)              multiple                  25216     
_________________________________________________________________
dense_8 (Dense)              multiple                  645       
=================================================================
Total params: 76,233
Trainable params: 76,233
Non-trainable params: 0
_________________________________________________________________
