Model: "model2_single_layer_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_3 (Dense)              multiple                  1285      
=================================================================
Total params: 1,285
Trainable params: 1,285
Non-trainable params: 0
_________________________________________________________________
