Model: "model2_single_layer"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                multiple                  2570      
=================================================================
Total params: 2,570
Trainable params: 2,570
Non-trainable params: 0
_________________________________________________________________
