Model: "model2_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_12 (Dense)             multiple                  50372     
_________________________________________________________________
dense_13 (Dense)             multiple                  25216     
_________________________________________________________________
dense_14 (Dense)             multiple                  1290      
=================================================================
Total params: 76,878
Trainable params: 76,878
Non-trainable params: 0
_________________________________________________________________
