Model: "model2_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_15 (Dense)             multiple                  50372     
_________________________________________________________________
dense_16 (Dense)             multiple                  25216     
_________________________________________________________________
dense_17 (Dense)             multiple                  645       
=================================================================
Total params: 76,233
Trainable params: 76,233
Non-trainable params: 0
_________________________________________________________________
